NYUAD-LabOps/3DP_Ros2/TitanNode/.eclipse/com.renesas.platform_1435879475/DebugComp/Synergy/IoFiles/R7FS3A17.svd
                <register>
                    <name>RSTSR1</name>
                    <description>Reset Status Register 1</description>
                    <addressOffset>0x0C0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xE0F8</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>13</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPERF</name>
                            <description>SP Error Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>SP error reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>SP error reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSMRF</name>
                            <description>Bus Master MPU Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus Master MPU reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus Master MPU reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSSRF</name>
                            <description>Bus Slave MPU Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus Slave MPU reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus Slave MPU reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>REERF</name>
                            <description>RAM ECC Error Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RAM ECC error reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RAM ECC error reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RPERF</name>
                            <description>RAM Parity Error Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RAM parity error reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RAM parity error reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRF</name>
                            <description>Software Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WDTRF</name>
                            <description>Watchdog Timer Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Watchdog timer reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Watchdog timer reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IWDTRF</name>
                            <description>Independent Watchdog Timer Reset Detect Flag
Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Independent watchdog timer reset not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Independent watchdog timer reset detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKRACR</name>
                    <description>Backup Register Access Control Register</description>
                    <addressOffset>0x0C6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x06</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKRACS</name>
                            <description>Backup Register Access Control Register</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Access control disable. When System clock source is SOSC or LOCO.</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>Access control enable. System clock source is other than SOSC or LOCO.</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBTCR1</name>
                    <description>VBATT Control Register1</description>
                    <addressOffset>0x41F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BPWSWSTP</name>
                            <description>Battery Power supply Switch Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Battery Power supply Switch Enable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Battery Power supply Switch stop</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBTCR2</name>
                    <description>VBATT Control Register2</description>
                    <addressOffset>0x4B0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VBTLVDLVL</name>
                            <description>VBATT Pin Voltage Low Voltage Detect Level Select Bit</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>2.7V</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Setting prohibited</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>2.3V</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>2.1V</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBTLVDEN</name>
                            <description>VBATT Pin Low Voltage Detect Enable Bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>VBATT pin low voltage detect disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>VBATT pin low voltage detect enable </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
