NYUAD-LabOps/3DP_Ros2/TitanNode/.eclipse/com.renesas.platform_1435879475/DebugComp/Synergy/IoFiles/R7FS3A17.svd
                <register derivedFrom="P000PFS_BY">
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>P50%sPFS_BY</name>
                    <description>P50%s Pin Function Control Register</description>
                    <alternateRegister>P50%sPFS</alternateRegister>
                    <addressOffset>0x143</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>11-12</dimIndex>
                    <name>P5%sPFS</name>
                    <description>P5%s Pin Function Control Register</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>11-12</dimIndex>
                    <name>P5%sPFS_HA</name>
                    <description>P5%s Pin Function Control Register</description>
                    <alternateRegister>P5%sPFS</alternateRegister>
                    <addressOffset>0x16E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>11-12</dimIndex>
                    <name>P5%sPFS_BY</name>
                    <description>P5%s Pin Function Control Register</description>
                    <alternateRegister>P5%sPFS</alternateRegister>
                    <addressOffset>0x16F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>P60%sPFS</name>
                    <description>P60%s Pin Function Control Register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>P60%sPFS_HA</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x182</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-6</dimIndex>
                    <name>P60%sPFS_BY</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x183</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P60%sPFS</name>
                    <description>P60%s Pin Function Control Register</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P60%sPFS_HA</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x1A2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P60%sPFS_BY</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x1A3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-14</dimIndex>
                    <name>P6%sPFS</name>
                    <description>P6%s Pin Function Control Register</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-14</dimIndex>
                    <name>P6%sPFS_HA</name>
                    <description>P6%s Pin Function Control Register</description>
                    <alternateRegister>P6%sPFS</alternateRegister>
                    <addressOffset>0x1AA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-14</dimIndex>
                    <name>P6%sPFS_BY</name>
                    <description>P6%s Pin Function Control Register</description>
                    <alternateRegister>P6%sPFS</alternateRegister>
                    <addressOffset>0x1AB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>P70%sPFS</name>
                    <description>P70%s Pin Function Control Register</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>P70%sPFS_HA</name>
                    <description>P70%s Pin Function Control Register</description>
                    <alternateRegister>P70%sPFS</alternateRegister>
                    <addressOffset>0x1C2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>P70%sPFS_BY</name>
                    <description>P70%s Pin Function Control Register</description>
                    <alternateRegister>P70%sPFS</alternateRegister>
                    <addressOffset>0x1C3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P70%sPFS</name>
                    <description>P70%s Pin Function Control Register</description>
                    <addressOffset>0x1E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P70%sPFS_HA</name>
                    <description>P70%s Pin Function Control Register</description>
                    <alternateRegister>P70%sPFS</alternateRegister>
                    <addressOffset>0x1E2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P70%sPFS_BY</name>
                    <description>P70%s Pin Function Control Register</description>
                    <alternateRegister>P70%sPFS</alternateRegister>
                    <addressOffset>0x1E3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-13</dimIndex>
                    <name>P7%sPFS</name>
                    <description>P7%s Pin Function Control Register</description>
                    <addressOffset>0x1E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-13</dimIndex>
                    <name>P7%sPFS_HA</name>
                    <description>P7%s Pin Function Control Register</description>
                    <alternateRegister>P7%sPFS</alternateRegister>
                    <addressOffset>0x1EA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-13</dimIndex>
                    <name>P7%sPFS_BY</name>
                    <description>P7%s Pin Function Control Register</description>
                    <alternateRegister>P7%sPFS</alternateRegister>
                    <addressOffset>0x1EB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P80%sPFS</name>
                    <description>P80%s Pin Function Control Register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P80%sPFS_HA</name>
                    <description>P80%s Pin Function Control Register</description>
                    <alternateRegister>P80%sPFS</alternateRegister>
                    <addressOffset>0x202</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P80%sPFS_BY</name>
                    <description>P80%s Pin Function Control Register</description>
                    <alternateRegister>P80%sPFS</alternateRegister>
                    <addressOffset>0x203</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>P90%sPFS</name>
                    <description>P90%s Pin Function Control Register</description>
                    <addressOffset>0x240</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>P90%sPFS_HA</name>
                    <description>P90%s Pin Function Control Register</description>
                    <alternateRegister>P90%sPFS</alternateRegister>
                    <addressOffset>0x242</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>P90%sPFS_BY</name>
                    <description>P90%s Pin Function Control Register</description>
                    <alternateRegister>P90%sPFS</alternateRegister>
                    <addressOffset>0x243</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
